[
  {
    "id": 1,
    "title": "Onboarding & Initial Friction",
    "date_range": "January, Day 8 - January, Day 31",
    "startTimestamp": "2025-01-08T21:30:00+08:00",
    "endTimestamp": "2025-01-31T22:25:00+08:00",
    "summary": "A stressed and time-poor Rohan struggles with initial onboarding tasks, forcing the Elyx team to adapt their approach to build early trust.",
    "trigger": "The episode was triggered by Rohan's first message (ID 1) about his high blood pressure and feeling 'completely drained and frustrated,' accompanied by a Garmin screenshot showing 'Unproductive' stress.",
    "friction_points": [
      "Rohan canceled the first scheduled onboarding call due to an 'urgent work fire.' (ID 10)",
      "He canceled the rescheduled call as well, citing a last-minute client dinner. (ID 18)",
      "He pushed back against the request to log food in MyFitnessPal, stating, 'I don't have time to weigh my food and log it.' (ID 20)"
    ],
    "outcome": "The Elyx team successfully navigated the friction by showing flexibility. Ruby offered to work around Rohan's 'fire-proof' schedule, and Carla pivoted from detailed logging to simple photo-based meal tracking. A successful onboarding call was held on January 27th, establishing trust.",
    "persona_change": {
      "before_state": "Rohan was frustrated, overwhelmed by work, and skeptical about his ability to integrate the program.",
      "after_state": "He felt heard and understood after the call, becoming cautiously optimistic, but still somewhat daunted by the data."
    },
    "profile_start": {
      "happiness": 4,
      "health": 5,
      "satisfaction": 3
    },
    "profile_end": {
      "happiness": 6,
      "health": 6,
      "satisfaction": 6
    }
  },
  {
    "id": 2,
    "title": "The ApoB Wake-Up Call",
    "date_range": "March, Day 2 - March, Day 22",
    "startTimestamp": "2025-03-02T09:00:00+08:00",
    "endTimestamp": "2025-03-22T07:30:00+08:00",
    "summary": "The first blood panel reveals a dangerously high ApoB level, causing initial panic but ultimately galvanizing Rohan and focusing the program on a clear, critical target.",
    "trigger": "Dr. Warren delivered the first blood panel results, highlighting an ApoB level of 130 mg/dL, defined as the primary focus for cardiovascular risk reduction.",
    "friction_points": [
      "Rohan panicked: '130? Everything I'm reading says that's terrible... Do I need to be on a statin?' (ID 90)",
      "Difficulty with exercise adherence due to crushing work (ID 98).",
      "Travel friction: Jakarta trip with limited healthy food options (ID 100)."
    ],
    "outcome": "Neel reframed the ApoB test as valuable data rather than failure. Carla provided practical travel nutrition strategies and soluble fiber recommendations. Advik reinforced behavior-data links by connecting saturated fat intake directly to suppressed HRV.",
    "persona_change": {
      "before_state": "Fearful, anxious, and questioning the team’s efficacy, panicking about long-term risk.",
      "after_state": "Shifted to determined and motivated, reframing anxiety into clear action and trusting data-driven progress."
    },
    "profile_start": {
      "happiness": 4,
      "health": 4,
      "satisfaction": 3
    },
    "profile_end": {
      "happiness": 6,
      "health": 6,
      "satisfaction": 6
    }
  },
  {
    "id": 3,
    "title": "Advanced Wearables & The Zone 2 Discipline",
    "date_range": "April, Day 2 - April, Day 16",
    "startTimestamp": "2025-04-02T08:30:00+08:00",
    "endTimestamp": "2025-04-16T08:10:00+08:00",
    "summary": "Rohan receives a Whoop strap and a VO2 Max-derived Zone 2 cardio prescription, but his high-achiever mindset clashes with the 'go slow to go fast' discipline.",
    "trigger": "The Elyx team upgraded monitoring by shipping a Whoop strap and prescribing a Zone 2 cardio plan after Rohan’s VO2 Max test.",
    "friction_points": [
      "Rohan questioned the choice of wearable ('Why Whoop and not Oura?'). (ID 123)",
      "He pushed harder than prescribed in Zone 2, entering Zone 4. (ID 129)",
      "Dismissed Whoop’s recovery warning as contradictory to how he felt. (ID 132)"
    ],
    "outcome": "Advik clarified the importance of Whoop and disciplined Zone 2 adherence. Neel reframed Zone 2 as critical training for longevity, not intensity. Rohan accepted that objective data reveals hidden strain before subjective feelings do.",
    "persona_change": {
      "before_state": "Restless, skeptical, and tempted to override instructions due to his achiever mentality.",
      "after_state": "Respectful of Zone 2 discipline and confident in the utility of objective biometrics even above subjective impressions."
    },
    "profile_start": {
      "happiness": 5,
      "health": 6,
      "satisfaction": 5
    },
    "profile_end": {
      "happiness": 7,
      "health": 7,
      "satisfaction": 7
    }
  },
  {
    "id": 4,
    "title": "The Turnaround: Crushing ApoB",
    "date_range": "June, Day 2 - June, Day 30",
    "startTimestamp": "2025-06-02T09:00:00+08:00",
    "endTimestamp": "2025-06-30T17:10:00+08:00",
    "summary": "The second blood panel reveals a massive drop in ApoB, validating the team's strategy and Rohan's hard work, leading to a profound mindset shift from reactive anxiety to proactive control.",
    "trigger": "Rohan expressed nervousness before his second quarterly blood panel: 'Honestly, a bit nervous given the last results.' (ID 145).",
    "friction_points": [
      "Pre-dinner anxiety: 'This will ruin my progress.' (ID 159)"
    ],
    "outcome": "ApoB dropped from 130 to 95 mg/dL. The team celebrated, reinforcing nutrition and exercise adherence as effective. Carla reframed risk management during dining, teaching resilience. The episode transitioned toward targeting hs-CRP inflammation.",
    "persona_change": {
      "before_state": "Worried, uncertain, viewing his progress as fragile and dependent on perfection.",
      "after_state": "Empowered, validated, and in control—explicitly noting he finally felt his health was under his control rather than reactive."
    },
    "profile_start": {
      "happiness": 5,
      "health": 6,
      "satisfaction": 5
    },
    "profile_end": {
      "happiness": 8,
      "health": 8,
      "satisfaction": 8
    }
  },
  {
    "id": 5,
    "title": "The CGM Experiment & An Impulsive Fast",
    "date_range": "July, Day 1 - July, Day 30",
    "startTimestamp": "2025-07-01T09:00:00+08:00",
    "endTimestamp": "2025-07-30T17:00:00+08:00",
    "summary": "Rohan uses a CGM for immediate feedback on nutrition but, feeling overconfident, impulsively starts a multi-day fast that backfires and requires team intervention.",
    "trigger": "Dr. Warren introduced a Continuous Glucose Monitor (CGM) to optimize diet for energy and cognition.",
    "friction_points": [
      "Rohan impulsively undertook a 3-day water fast without consulting the team. (ID 196)"
    ],
    "outcome": "The CGM provided eye-opening personalized nutrition insights (oatmeal vs. eggs). However, his impulsive fasting attempt backfired, with Whoop showing dangerous strain. The team intervened to halt it, teaching Rohan the role of structured, supervised fasting and reinforcing expert guidance. A clean MRI all-clear also boosted reassurance.",
    "persona_change": {
      "before_state": "Excited and empowered by CGM data, yet overconfident and prone to self-experimentation without oversight.",
      "after_state": "Humbled, recognizing the need for team guidance, while still excited by proactive data use. Reassured by MRI confirmation of baseline health."
    },
    "profile_start": {
      "happiness": 6,
      "health": 7,
      "satisfaction": 6
    },
    "profile_end": {
      "happiness": 7,
      "health": 7,
      "satisfaction": 7
    }
  },
  {
    "id": 6,
    "title": "The Peak Performance Protocol",
    "date_range": "August, Day 1 - August, Day 10",
    "startTimestamp": "2025-08-01T09:00:00+08:00",
    "endTimestamp": "2025-08-10T10:30:00+08:00",
    "summary": "Rohan requests a protocol for a high-stakes keynote, and after a brief stumble, successfully leverages the Elyx system to achieve peak performance, solidifying his belief in the program as a competitive advantage.",
    "trigger": "Rohan explicitly requested a 'Peak Performance Protocol' for his keynote at the APAC FinTech Summit in Seoul.",
    "friction_points": [
      "He asked about nootropics and beta-blockers for anxiety management. (ID 228)",
      "Stress caused a binge-eating lapse before his trip, leading to guilt. (ID 239)"
    ],
    "outcome": "The Elyx team provided an integrated protocol combining circadian optimization, nutrition stabilization, and deload physical training. They coached him through his lapse with reassurance. The keynote was a huge success, Rohan performed at his peak, and the experience reframed the program as a professional edge.",
    "persona_change": {
      "before_state": "Proactive but tempted by shortcuts (nootropics) and vulnerable to self-blame under stress.",
      "after_state": "Clear-headed, confident, and fully aligned with Elyx philosophy, declaring the program as enabling 'elite performance' and long-term professional advantage."
    },
    "profile_start": {
      "happiness": 7,
      "health": 7,
      "satisfaction": 6
    },
    "profile_end": {
      "happiness": 9,
      "health": 9,
      "satisfaction": 9
    }
  }
]
